client/message.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
    <soapenv:Header />
    <soapenv:Body>
        <tem:SdmReceive>
            <!--Optional:-->
            <!--type: string-->
            <tem:message>
                <Document>
                    <Header>
                        <Sender>E80</Sender>
                        <Receiver>HOST</Receiver>
                        <SendDate>2012-09-12 18:05:38+02.00</SendDate>
                        <MessageType>MSG_3</MessageType>
                        <MessageId>12345</MessageId>
                    </Header>
                    <Body>
                        <EnterLocation>PL01</EnterLocation>
                        <LPN>3423542</LPN>
                    </Body>
                </Document>
            </tem:message>
        </tem:SdmReceive>
    </soapenv:Body>
</soapenv:Envelope>
